<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTDPLIST1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download Mist, a gui tool that automatically generates macOS Installer Disk Images and Packages.</string>
        <key>Identifier</key>
        <string>com.github.inkeyes.download.mist-gui</string>
        <key>Input</key>
        <dict>
            <key>INCLUDE_PRERELEASES</key>
            <string></string>
            <key>NAME</key>
            <string>Mist</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>include_prereleases</key>
                    <string>%INCLUDE_PRERELEASES%</string>
                    <key>github_repo</key>
                    <string>ninxsoft/Mist</string>
                    <key>asset_regex</key>
                    <string>^.*\.dmg$</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                    <key>Processor</key>
                    <string>CodeSignatureVerifier</string>
                    <key>Arguments</key>
                    <dict>
                        <key>input_path</key>
                        <string>%pathname%</string>
                        <key>expected_authority_names</key>
                        <array>
                                <string>Developer ID Installer: Nindi Gill (7K3HVCLV7Z)</string>
                                <string>Developer ID Certification Authority</string>
                                <string>Apple Root CA</string>
                        </array>
                    </dict>
                </dict>
        </array>
    </dict>
</plist>