	<?xml version="1.0" encoding="UTF-8"?>
	<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
	<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest LockRattler release and save it as a disk image. This is a test.</string>
		<key>Identifier</key>
		<string>com.github.inkeyes.download.LockRattler</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>LockRattler</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.4</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://eclecticlight.co/downloads/</string>
					<key>re_pattern</key>
					<string>href="https:\/\/eclecticlightdotcom\.files\.wordpress\.com\/([\d]+\/[\d]+)\/lockrattler[\d]+\.zip</string>
					<key>result_output_var_name</key>
					<string>date</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://eclecticlight.co/downloads/</string>
					<key>re_pattern</key>
					<string>href="https:\/\/eclecticlightdotcom\.files\.wordpress\.com\/[\d]+\/[\d]+\/lockrattler([\d]+)\.zip</string>
					<key>result_output_var_name</key>
					<string>version</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://eclecticlightdotcom.files.wordpress.com/%date%/lockrattler%version%.zip</string>
					<key>filename</key>
					<string>%NAME%%version%.zip</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/lockrattler%version%</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
					<key>pathname</key>
					<string>%dmg_path%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/downloads/%NAME%%version%.zip</string>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/LockRattler.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "co.eclecticlight.LockRattler" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QWY4LRW926)</string>
				</dict>
			</dict>
		</array>
	</dict>
	</plist>